#+name: Snares rising
#+STARTUP: indent overview hidestars

* Demo
#+begin_src scheme :results output
  (car (list 1 2 3))
#+end_src

#+RESULTS:

#+begin_src scheme :results output 
  (display (map (lambda (x) (modulo x 2)) (iota 10)))
#+end_src

#+RESULTS:
:results:
(0 1 0 1 0 1 0 1 0 1)
:end:

#+begin_src scheme :results output
  (format #t "~a" "Hej då")
#+end_src

#+RESULTS:
: Hej då


#+begin_src sclang :results none
  b = NodeProxy.new.play;
  b.source = { PinkNoise.ar(0.2.dup) };
#+end_src

